{
    "projects": [
        {
            "keyword": "theheistvr",
            "title": "The Heist VR",
            "short-description": "A local asymmetric multiplayer game for VR and desktop. Developed as part of my thesis project in TU Dublin. ", 
            "type": "virtualreality videogames", 
            "year": "April 2021", 

            "author": "Philip Toolan",
            "awards": "First Class Honours",
            "awards-url": "",
            "client": "TU Dublin Thesis",
            "client-url": "",

            "buttons": [["Access the code", "https://github.com/PhilToolan/Final-Year-Project"]],

            "cover-img": "theheistvr0.png",
            "long-description":"Virtual reality has an impressive ability to allow players to escape reality. Recent advances in hardware have given players higher fidelity worlds, increased pixel counts in screens, improved depth and range of sound and even smell. Fields of view have been increased to reduce the “binocular effect”. This project investigates the software side of virtual reality. There have been some improvements in software such as: better tracking technology and the quality of art assets (to match their equivalent in the real world). By developing this project, the aim is to use software to improve immersion in virtual reality. This is accomplished by incorporating asymmetric multiplayer mechanics to invite the real world into the virtual and prevent potential breaks in immersion occurring. The project discovered that this method had a positive effect on immersion. This finding is limited by a number of factors. The quality of gameplay, the number of participants, lack of in-person testing and the number of games compared. The project consisted of constructing a game around this multiplayer mechanic and compare it with an existing single player experience. A sample size of eight experienced players were exposed to both games and were then tested by questionnaire after their playthroughs. The findings are consistent with the hypothesis that asymmetric multiplayer enhances the immersive experience of virtual reality.", 
            "role": "The project was done entirely by myself including all programming, modelling, art and the final thesis. As part of the project programming, VR interactions, VR and desktop user interfaces, top down gameplay, networking and VR gameplay were done. The 3D models were focused on an office environment and were exported and imported in the .fbx file format. The game was built using the Unity game engine and the Unity XR Interaction Toolkit was used to handle inputs from a VR headset. All the modelling and texturing was done in Blender. The Game Design Document was created in Adobe InDesign. ", 
            
            "images":[["theheistvr0.png", "one"], ["theheistvr0.png", "two"], ["theheistvr0.png", "two"], ["ansibin-jr.mp4", "video"]], 
            
            "featured": "no"
        }, 
        {
            "keyword": "vrfish",
            "title": "VR Fish Meditation",
            "short-description": "A relaxing experience created using Unity ECS to simulate a school of fish, Conway's Game of Life and more.", 
            "type": "virtualreality proceduralgeneration", 
            "year": "January 2022", 

            "author": "Philip Toolan",
            "awards": "",
            "awards-url": "",
            "client": "FH Upper Austria Assignment",
            "client-url": "",

            "buttons": [["Access the code", "https://github.com/PhilToolan/Unity-ECS"]],

            "cover-img": "theheistvr0.png",
            "long-description":"Sit back and relax as you watch a school of 15,000 fish all swim around the environment procedurally. The fish consist of 15,000 boids that are updated in real time using separation, cohesion, alignment, constrain and wander behaviours. Procedural animation is also used on each fish to animate them in real time as they interact with their environment. In total there is 28,000 entities being updated every frame, with a performance of over 100fps on desktop and around 90fps in VR. The project also includes a number of other projects using the entity component system in Unity including Conway's Game of Life and real time mesh deformation. ", 
            "role": "The project was created as an assignment in the Interactive Media master at FH Upper Austria. It was created using C#, Unity ECS and Blender. ", 
            
            "images":[["theheistvr0.png", "one"], ["theheistvr0.png", "two"], ["theheistvr0.png", "two"], ["ansibin-jr.mp4", "video"]], 
            
            "featured": "no"
        }, 
        {
            "keyword": "forest",
            "title": "Forest FLIR Simulation",
            "short-description": "Recreation of a forest environment and simulation of FLIR data for that environment.", 
            "type": "realtime3d 3dmodelling proceduralgeneration ", 
            "year": "February 2022", 

            "author": "Philip Toolan",
            "awards": "",
            "awards-url": "",
            "client": "FH Upper Austria Project",
            "client-url": "",

            "buttons": [["Access the final report", "https://github.com/PhilToolan/Unity-ECS"]],

            "cover-img": "theheistvr0.png",
            "long-description":"The project was completed as part of a semester project at FH Upper Austria. It recreates a forest environment that is common in Austria, then simulates the FLIR data for that environment. Unreal engine 4 and SpeedTree 8 are used to recreate a forest environment. The trees are procedurally spawned to create the forest and then post processing materials are used to dynamically show the FLIR data for the entire level. ", 
            "role": "I created the entire project using blueprints in Unreal, the tree models were made in SpeedTree and the texturing was done in SpeedTree and unreal. The accompanying project report was also written by me with greater details of the project. ", 
            
            "images":[["theheistvr0.png", "one"], ["theheistvr0.png", "two"], ["theheistvr0.png", "two"], ["ansibin-jr.mp4", "video"]], 
            
            "featured": "yes"
        },
        {
            "keyword": "brand",
            "title": "VIVI Branding",
            "short-description": "My personal brand, VIVI.", 
            "type": " branding ", 
            "year": "June 2020", 

            "author": "Philip Toolan",
            "awards": "",
            "awards-url": "",
            "client": "",
            "client-url": "",

            "buttons": [["Access the full brandbook", "https://github.com/PhilToolan/Unity-ECS"]],

            "cover-img": "theheistvr0.png",
            "long-description":"My own personal brand, VIVI. It is short for vivify which means to make alive. This perfectly encapsulates my ambition to turn code into something incredible. The brand creation process took place over a number of weeks from initial concept to final design. The entire BrandBook can be found online. ", 
            "role": "All the designs and concept were developed over the period of a month. The final deisgns and mockups were made in Adobe Illustrator, Photoshop and InDesign. ", 
            
            "images":[["theheistvr0.png", "one"], ["theheistvr0.png", "two"], ["theheistvr0.png", "two"], ["ansibin-jr.mp4", "video"]], 
            
            "featured": "no"
        },
        {
            "keyword": "stargate",
            "title": "Stargate SG-1 Battle Recreation",
            "short-description": "Recreation of the battle of Antarctica from Stargate SG-1, made in Unity. The project was implemented using procedural generation and boids.", 
            "type": "realtime3d proceduralgeneration", 
            "year": "May 2021", 

            "author": "Philip Toolan",
            "awards": "",
            "awards-url": "",
            "client": "",
            "client-url": "",

            "buttons": [["Access the code", "https://github.com/PhilToolan/GE2-Assignment"]],

            "cover-img": "theheistvr0.png",
            "long-description":"The battle scene is recreated using various triggers that cause the scene changes. Predator prey simulation is used for background fights in the battle. The prey follows a set of way points until it is being attacked at which point it will flee and find some ammo so it can attack the predator back. The predator pursues the prey until it runs out of ammo, at which point it will search for some randomly spawned ammo. This makes an organic looking fight between the ships. Other behaviours are used throughout like obstacle avoidance. As the experience is controlled by AI, the minute details will not be the same every time it runs but the overarching narrative is always the same. A complete rundown of the project can be found on the GitHub.", 
            "role": "The project was created as part of a class assignment in my final year of TU Dublin. I programmed the entire experience using C# and Unity. The 3D models are from various users on SketchFab.", 
            
            "images":[["theheistvr0.png", "one"], ["theheistvr0.png", "two"], ["theheistvr0.png", "two"], ["ansibin-jr.mp4", "video"]], 
            
            "featured": "no"
        }
    ]
}
